Revit 2026 API

# CompoundStructureGetAdjacentRegions Method

---

Gets the ids of region bound to a specified segment.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<int> GetAdjacentRegions(
	int segmentId
)
```
```vb
Public Function GetAdjacentRegions (
	segmentId As Integer
) As IList(Of Integer)
```
```cpp
public:
IList<int>^ GetAdjacentRegions(
	int segmentId
)
```
```fsharp
member GetAdjacentRegions :
        segmentId : int -> IList<int>
```

#### Parameters

segmentId Int32
     The id of a segment in this CompoundStructure.

#### Return Value

IListInt32 The ids of the regions that are bounded by the specified segment.

| Exception | Condition |
| --- | --- |
| ArgumentException | The segment id is invalid. |
| InvalidOperationException | This operation is valid only for vertically compound structures. |

The boundaries of the regions of a vertically compound structure consist of vertical horizontal segments with unique ids. The segments which define the outer boundary of the structure are adjacent to one region, other segments will be adjacent to two regions.

#### Reference

CompoundStructure Class

Autodesk.Revit.DB Namespace